{"post_id":"1nnbjm5","subreddit":"stocks","created_utc":1758510513,"title":"Could the potential invasion of Eastern Europe by Russia cause a crash in markets?","selftext":"With Russia escalating alongside the eastern border of NATO countries it seems ever more likely that a full scale war across Europe could break out. I understand it’s pretty obvious markets would react negatively but how detrimental really would a large scale war in Europe be financially? \n\nRussia’s control of oil supply could send gas prices soaring but what about the economic impact from Eastern Europe at war? Russia doesn’t seem to be ready for a full scale war against NATO and seems to be testing the waters but they are preparing to do so. I think if we see congressmen start selling off their stocks like we saw before COVID that would be a great sell signal to GTFO before the market crashes. \n\nHistorically how have markets reacted to large scale wars? We haven’t really had a large scale war since WW2 so we don’t have recent examples to go off of except maybe around 9\/11 and the beginning of war in the Middle East but that doesn’t affect global markets like a war in Europe would. I also assume investing in defense contractors would turn out to be very profitable. \n\nWhat does everyone think? Will this be the next big stock market correction or are there bigger problems near term?","score":0,"num_comments":54,"url":"https:\/\/www.reddit.com\/r\/stocks\/comments\/1nnbjm5\/could_the_potential_invasion_of_eastern_europe_by\/","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539883,"is_comment":false}
{"post_id":"1nn2lf6","subreddit":"stocks","created_utc":1758486211,"title":"So I heard you like dividends...","selftext":"Below are 5 of the highest yielding stocks with a market cap over $50B. Do you know of any better options when it comes to dividends?\n\n# 1. United Parcel Service (UPS)\n\n* Market Cap: \\~$72 billion\n* App. Dividend Yield: \\~7.8%\n* Global leader in logistics and package delivery. The company has a long history of paying and growing its dividend, with a 16-year streak of increases. \n\n# 2. Pfizer (PFE)\n\n* Market Cap: \\~$137 billion\n* App. Dividend Yield: \\~7.0%\n* One of the world's largest pharmaceutical companies with a deep portfolio of drugs, a significant cash flow and a consistent history of paying a strong dividend.\n\n# 3. Verizon Communications (VZ)\n\n* Market Cap: \\~$184 billion\n* App. Dividend Yield: \\~6.3%\n* Major telecommunications company, often considered a defensive play. It provides essential services that generate predictable cash flow, has a long track record of consistent dividend payments.\n\n# 4. LyondellBasell Industries (LYB)\n\n* Market Cap: \\~$47 billion\n* App. Dividend Yield: \\~10.2%\n* Global chemical company widely known for its exceptionally high yield. Market cap is currently just below $50 billion, but an important company for those seeking high-yield options. \n\n# 5. Enbridge (ENB)\n\n* Market Cap: \\~$75 billion\n* App. Dividend Yield: \\~5.5%\n* Operates a crude oil and liquid petroleum pipeline system in North America, based on long-term contracts for pipeline usage, generating stable and predictable cash flows. This stability allows a reliable dividend, which has a long history of increases.","score":135,"num_comments":113,"url":"https:\/\/www.reddit.com\/r\/stocks\/comments\/1nn2lf6\/so_i_heard_you_like_dividends\/","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539883,"is_comment":false}
{"post_id":"1nngj45","subreddit":"stocks","created_utc":1758528158,"title":"Rolls-Royce (RYCEY) is on a Roll !","selftext":"So much positive news in the past few weeks alone…\n\n- Rolls Royce CEO was with US President Donald Trump and UK Prime Minister Keir Starmer at the Windsor Castle Banquet last week.\nhttps:\/\/www.reddit.com\/r\/RYCEY\/comments\/1nk92wl\/was_tufan_erginbilgic_at_the_uk_state_dinner\/\n \n- Nuclear energy stocks are roaring upwards, sending nuclear energy speculative stocks soaring despite being loss-making, and despite no revenues in some cases (OKLO!), so it’s only a matter of time before attention turns to a high-growth, cash-generative business like Rolls Royce, which keeps announcing new deals.\n\n- Rolls-Royce won a £2,500,000,000 deal in June to build nuclear reactors in the United Kingdom. Last week, they’ve issued a statement on it welcoming in the “Golden Age” of nuclear energy.  \nhttps:\/\/www.rolls-royce.com\/media\/press-releases\/2025\/15-09-2025-rr-welcomes-action-from-uk-and-us-governments-to-usher-in-new-golden-age-of-nuclear-energy.aspx\n\n- Rolls-Royce builds and maintains the Nuclear reactors powering submarines.  They signed a £9,000,000,000 contract with the UK Ministry of Defence to provide long-term support for the existing fleet and future builds, securing its role in the UK's nuclear deterrent for decades to come.  More countries will look to sign similar deals. \nhttps:\/\/www.rolls-royce.com\/media\/press-releases\/2025\/24-01-2025-rolls-royce-signs-landmark-unity-contract-with-uk-ministry-of-defence.aspx\n\n\n- Earlier in September, Rolls-Royce announced their involvement in providing reactors for Australia's new fleet of nuclear submarines, under the AUKUS defense agreement with the UK and US, further expanding its role in nuclear submarine technology: \nhttps:\/\/www.rolls-royce.com\/media\/press-releases\/2025\/10-09-2025-rr-signs-skills-and-technology-agreements-with-western-and-south-australian-governments-in-support-of-aukus.aspx\n\n- Zacks Investment Research have published a bullish pro-Rolls article on Friday entitled: “The Best AI Nuclear Energy Stock to Buy Not Named Oklo“ \nhttps:\/\/www.zacks.com\/commentary\/2754426\/the-best-ai-nuclear-energy-stock-to-buy-not-named-oklo\n\n- Goldman Sachs have initiated coverage of RR with a Buy rating, with a target of £12.90 \/  $17.40  - recognising the turnaround story since covid, and the huge profit margin and FCF improvements in recent years.\n\n- Citigroup have upgraded their price target to £14.40 \/ $19.44.\n(The difference appears to be that Citigroup have recognised how massively exciting the Nuclear Energy side of the business is, whereas Goldman haven’t even mentioned it.)\n\n- The vast majority of analysts are rating RR a buy. \n \n- Saudi Arabia Railways will be using more Rolls-Royce engines in their trains than before. Since 2012, there have been seventy 12V 4000 engines used in trains operated by Saudi Arabia Railways, and – having been impressed by their quality even in the harshest of conditions – Saudi Arabia have ordered an additional 50 trains with RR engines, as announced a month ago. A statement on the quality of their engines - not only in planes ! \nhttps:\/\/www.rolls-royce.com\/media\/press-releases\/2025\/21-08-2025-rr-to-supply-50-mtu-engines-for-high-speed-trains-in-saudi-arabia.aspx\n\n- Rolls’s Power Systems division has received its largest ever Battery Energy Storage System (BESS) order, after Lithuanian energy supplier Ignitis selected Rolls-Royce to supply large-scale battery energy storage systems, in a huge deal announced last week. \nhttps:\/\/www.rolls-royce.com\/media\/press-releases\/2025\/16-09-2025-rr-biggest-battery-order-for-rolls-royce-large-scale-energy-storage-system-in-lithuania.aspx\n \n\n \nSure I’ve missed so many things there as all the many divisions of Rolls-Royce seems to be on turbo charge at the moment.\n\nWith aviation demand rising (and especially from Airbus more than Boeing),  with defence spending rising, and with the growing and desperate need for more sustainable energy solutions from nuclear, etc etc, it is inevitable that Rolls-Royce will be announcing more deals on all fronts in the coming weeks and months.  \n[…and it can only help to be having dinner with the Trump and Starmer last week!]\n\nOn this basis, I believe we will £20 within the next 12 months =  74% higher than we are here.  And longer term it’ll be multiples of where it is today. And it is all backed up by solid real results - real revenues, real profit, and real deals worth billions.  \n\nRolls-Royce is a winner ! ","score":24,"num_comments":3,"url":"https:\/\/www.reddit.com\/r\/stocks\/comments\/1nngj45\/rollsroyce_rycey_is_on_a_roll\/","keyword_matched":"battery","scope_name":"scope_energy","ingested_at_utc":1758539884,"is_comment":false}
{"post_id":"1nnjhu9","subreddit":"energy","created_utc":1758539203,"title":"Oil prices little changed as Russia, Mideast concerns offset by oversupply worry","selftext":"","score":1,"num_comments":1,"url":"https:\/\/www.reuters.com\/business\/energy\/oil-inches-up-tension-flares-europe-middle-east-2025-09-22\/","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539884,"is_comment":false}
{"post_id":"1nne2qk","subreddit":"energy","created_utc":1758518846,"title":"Sanctioned tanker discharges Russian oil at India's Mundra port, data shows","selftext":"","score":11,"num_comments":1,"url":"https:\/\/www.reuters.com\/business\/energy\/sanctioned-tanker-discharges-russian-oil-indias-mundra-port-data-shows-2025-09-16\/","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539884,"is_comment":false}
{"post_id":"1nncoja","subreddit":"energy","created_utc":1758514082,"title":"Iraq increased oil exports after OPEC+ eased cuts","selftext":"Iraq increased oil exports after OPEC+ eased cuts. August exports averaged 3.38M bpd, with Sept expected at 3.4-3.45M bpd. Increased exports aim to boost revenue, but Iraq faces pressure to cut output due to overproduction. [https:\/\/starfeu.com\/](https:\/\/starfeu.com\/) ","score":3,"num_comments":1,"url":"https:\/\/www.reddit.com\/r\/energy\/comments\/1nncoja\/iraq_increased_oil_exports_after_opec_eased_cuts\/","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539884,"is_comment":false}
{"post_id":"1nn2nvi","subreddit":"energy","created_utc":1758486375,"title":"Trump Renews Pressure on Europe to Stop Buying Russian Oil","selftext":"","score":20,"num_comments":2,"url":"https:\/\/www.bloomberg.com\/news\/articles\/2025-09-21\/trump-renews-pressure-on-europe-to-stop-buying-russian-oil?leadSource=reddit_wall","keyword_matched":"oil","scope_name":"scope_energy","ingested_at_utc":1758539884,"is_comment":false}
{"post_id":"1nn2nvi","subreddit":"energy","created_utc":1758486375,"title":"Trump Renews Pressure on Europe to Stop Buying Russian Oil","selftext":"","score":21,"num_comments":2,"url":"https:\/\/www.bloomberg.com\/news\/articles\/2025-09-21\/trump-renews-pressure-on-europe-to-stop-buying-russian-oil?leadSource=reddit_wall","keyword_matched":"renewables","scope_name":"scope_energy","ingested_at_utc":1758539885,"is_comment":false}
{"post_id":"1nmymj1","subreddit":"energy","created_utc":1758477119,"title":"US Energy Dept Begs For More Renewable Energy, Pleeeeese!!! After cutting the US wind and solar industries off at the knees, the Trump admin has finally woken up to the fact that wind and solar are the only abundant, accessible energy resources. “Speed to Power” is more of a plea than a plan.","selftext":"","score":874,"num_comments":67,"url":"https:\/\/cleantechnica.com\/2025\/09\/20\/us-energy-dept-begs-for-more-renewable-energy-pleeeeese\/amp\/","keyword_matched":"renewables","scope_name":"scope_energy","ingested_at_utc":1758539885,"is_comment":false}
{"post_id":"1nnbga8","subreddit":"energy","created_utc":1758510236,"title":"Solar energy. Recommendation","selftext":"Someone guide me 🙏 How to configure the RENOGEM 3 KVA 24 V inverter with 4 270w panels (each) and 4 AGM 12v 200ah batteries (2 and 2 in series)\nI know how to modify the 36 parameters but in many of them I don't know what is convenient for it to work well without bursting the batteries..","score":2,"num_comments":0,"url":"https:\/\/www.reddit.com\/r\/energy\/comments\/1nnbga8\/solar_energy_recommendation\/","keyword_matched":"battery","scope_name":"scope_energy","ingested_at_utc":1758539885,"is_comment":false}
